# shellのarray

:<<"END"
#shellの配列
１。配列の割り当て
２。配列のアクセス
３。配列の長さ
END

# 1.配列の割り当て
# 使い方１）　ある配列[インデックス]=割り当てもの
# 例）　色の入れるに green red blue を入れる
Color1[0]="green"
Color1[1]="red"
Color1[2]="blue"

# 使い方２）　ある配列＝（割り当てものたち）
# 例） 上と同じ
Color2=("green", "red", "blue")

  
#　2.配列にアクセス
# 使い方）配列にアクセスする時には${配列名[インデックス]}にエクセスする
  
#　例１）Color[1]を出力
echo ${Color1[1]}
#　その結果：red

#　例２）Color1の全ての要素を出力 //${配列名[*]}・＄{配列名[@]}で全ての要素にアクセス
echo ${Color1[@]}
# その結果：　green red blue

# ３.配列の長さ
# 使い方）　${＃配列名[*]}・${#配列名[＠]}

# 例）　Color2の長さを出力
echo ${#Color2[*]}
# その結果：3