# shellの環境変数

:<<"END"
1.shellの環境変数とは
2.Linuxの定義されている環境変数
END

:<<"END"
1.shellの環境変数とは

環境変数はある変数を定義したシェル・そのシェルで実行されるプログラムで有効な変数だ。
子フロセスには親フロセスの環境変数のコピーが伝える。
逆には伝えない。

使い方１（環境変数を指定した後出力）
＞
１。変数を指定
２。export 変数名　//　その変数は環境変数になる
3。echo ＄変数名 // その変数が出力

使い方２（子プロセスでその親の環境変数を使う）
＞
１。bash // 新しいbash（子プロセス）を使う
2。echo ＄変数名 // 子プロセスでもその変数が出力できる

使い方３(子プロセスの環境変数は親プロセスに影響できない)
＞
1。上の環境変数名を変更　
2。echo $その変数名　// 変わった環境変数を出力
３。exit // 親プロセスで戻る
4。echo ＄その変数名　// 変わった環境変数で出力しないし、最初のものを出力
END

# 例１）A変数に"HELLO”を指定した後、環境変数に定義して出力
A="HELLO"
export A # その変数は環境変数になる
echo $A
# その結果：HELLO

# 例２）子エクセスでその環境変数を出力
bash #子エクセス
echo $A
# その結果：HELLO

# 例３）A変数を子エクセスで変えても親に影響はない
A="BYE" #子エクセスで変更
exit #親プロセスに戻る
echo $A 
# その結果：HELLO

:<<"END"
2.Linuxの定義されている環境変数

環境変数名 / 保存されていたデータ
HOME / ログインユーザのホームディレクトリ
PWD / 現在のディレクトリ
USER / ログインユーザの名
HOSTNAME ／コンピュータのホスト名
PATH / コマンド・プログラムを検索するディレクトリ
HISTSIZE / コマンド履歴の保存件数
LANG / 使用する言語
SHELL / ログインユーザのシェル
END

# 例） ログインユーザのシェルを出力
echo $SHELL
# その結果：/bin/bash