# リダイレクト

:<<"END"
リダイレクトは
Unixでコマンドの実行結果（stdout)・エラー結果(stderr)の出力・データ入力元(stdin)をデフォルトから変更すること

Unixにはファイルディスクリプタというものがり、プロセスと使用するファイルとを結び付けている。
あるプロセスがファイルを作成する場合、必ずプロセスはそのファイルを使ってファイルへアクセスしている。
ファイルディスクリプタは０〜２に数値で表現する。
1 標準入力　stdin
2 標準出力　stdout
3 標準エラー　stderr
END

:<<"END"
stdoutとは

１。＞を使ってスクリプトの実行結果をファイルに残す。ファイルがない場合は作る。ファイルの内容がある場合は上書く。
２。＞代わりに＞＞を使うとファイルの内容があっても上書かなく、内容を追加する。
END

# 例１）＞を使って新しい”A .txt"ファイルを作って”HELLO”文字列を作成
echo "HELLO" > A.txt 
#　その結果：A.txtには”HELLO"が入る。

#　例２）>>を使って”A .txt"の内容に”BYE"文字列を追加
echo "BYE" >> A.txt
# その結果：A.txtには”HELLO”の後に”BYE"入る