# - chmod
# chmodはファイルのパーミッション（読み込み・書き込み・実行）の設定を「所有者」「グループ」「その他のユーザ」にそれぞれ割り振るコマンドだ。

# パーミッションを確認する方法
# ls -l <ファイル名＞　で確認できる。
# その結果: 「所有者：---」「グループ：---」「その他のユーザ：---」 パーミッション・「所有者」「グループ」「その他ユーザ」の名順で表示される。

# パーミション
# --- ３つで表示される。rwx３つはそれぞれ（r=読み込み / w=書き込み　/ x=実行）のパーミッションを意味
# 2進法で　0=--- / 7=rwxで表現できる。

# 使い方1)chmod <変更する内容＞　＜ファイル名＞ // そのファイルのパーミションを変更。
chmod 777 chmod.sh
# その結果: chmod.shの所有者」「グループ」「その他ユーザ」のパーミッションが読み込み・書き込む・実行できるので変わる。

:<<"END"
chmodのオプション

-f エラーメッセージを表示しない
-c コマンド実行時に変更があった時のみ結果を表示
-v コマンド実行時に詳細を表示
-R ディレクトリ内の複数のファイルも変更対象とする
END

#　例）-R オプション
chmod -R 777 linux-commands
# linux-commandsのディレクトリーのファイル全て変更
