# - chown
# chownはファイル・ディレクトリーのユーザーの所有権やグループの所有権を変更するコマンド。

# ユーザーの所有権
# ユーザーの所有権はファイルの作成・実行などをどのユーザーが可能の意味。ファイル・ディレクトリーを作成したユーザーのIDで指定される。

# グループの所有権
# いろいろなユーザーが共に管理するためのものだ。人たちをグループして管理する。

# chownの使い方
# 所有権の変更のためにはスーパーユーザーに変更する必要がある
su # スーパーユーザーに変更

# chown ＜変更する所有者> <変更するファイル名＞
chown root chown.sh
#　chown.shのファイルの所有権がrootに変更
# グループの場合、利用者：グループで使う
chown root:root chown.sh
# chown.shのユーザー・グループの所有権全てrootに変更

:<<"END"
chownのオプション

-c 所有者の変更の場合表示
-f エラーメッセージを表示しない
-h シンボリックリンクの所有権も変更する
-R ディレクトリ内の所有権も変更する
-v 所有者変更情報を変更と関係なく表示する
END