# - grep
# grepはファイルにある文字列があるのかを確認するコマンドだ。

# 使い方1)grep <文字列＞ <ファイル名＞ // ファイルの中でその文字列を持っているの確認
grep grep grep.sh
# その結果：grepが表示される。
# その文字列がない場合は出力なし。

# 使い方2)grep ＜文字列＞　＜パス・ファイル名＞ // 色々なファイルで確認する。
grep grep./*
# その結果：ファイル名：grepで現在のディレクリーでgrepを持っているファイルを表示。

# 使い方3)grep -v <文字列＞ <ファイル名＞ // ファイルの中でその文字列を持ってない部分を確認
grep -v grep grep.sh
# その結果：grep.shのファイルでgrepではない部分が表示。

# 使い方４)grep -i <文字列＞ <ファイル名＞ // ファイルの中でその文字列を持っている部分を文字の大小を関係なく確認
grep -i grep grep.sh
# その結果：grep.shのファイルでgrepではない部分を文字の大小を関係なくが表示。

# 使い方5)grep -c <文字列＞ <ファイル名＞ // ファイルの中でその文字列を持っている行数の確認
grep -c grep grep.sh
# その結果：grepがある行数を表示される。