# - tail
# tailはファイルの末尾を確認するコマンドだ。

# 使い方1)tail <ファイル名＞ // ファイルの末尾(基本的に１０行)を確認
tail tail.sh
# その結果：tail.shの末尾の１０行が表示される。

# 使い方2)tail ＜パス・ファイル名＞ // あるパスのファイルの末尾(基本的に１０行)を確認
tail shell/linux-commands/tail.sh
# その結果：上のディレクトリーのtail.shの末尾の１０行が表示される。

# 使い方3)tail -f <ファイル名＞ // ファイルの末尾の変更を監視する。
tail -f tail.sh
# その結果：tail.shの変更を監視して内容を出力

# 使い方4)tail <ファイル名1＞ <ファイル名2＞ <ファイル名3＞ ...// いろいろなファイルの末尾を確認する。
tail tail.sh top.sh ps.sh
# その結果：３つのファイルの末尾が表示される。

# 使い方5)tail <*.ファイル名＞ // *を使うとある名前を持っているファイルの末尾を確認する。
tail *.sh
# その結果：.shを名前で持っているファイルの末尾が表示される。